export interface CombinationSet {
    title: string;
    items: string[];
    description?: string;
}

export const combinationsData: Record<string, CombinationSet> = {
  "combinations-aa": {
    title: "ترکیب ها با آ",
    items: [
      "با", "تا", "ثا", "جا", "حا", "خا", "دا", "ذا", "را", "زا", "سا", "شا", "صا", "ضا", "طا", "ظا", "عا", "غا", "فا", "قا", "لا", "ما", "نا", "ها", "وا", "پا", "چا", "ژا", "کا", "گا", "یا"
    ]
  },
  "combinations-oo": {
    title: "ترکیب ها با او",
    items: [
      "بو", "تو", "ثو", "جو", "حو", "خو", "دو", "ذو", "رو", "زو", "سو", "شو", "صو", "ضو", "طو", "ظو", "عو", "غو", "فو", "قو", "لو", "مو", "نو", "هو", "وو", "پو", "چو", "ژو", "کو", "گو", "یو"
    ]
  },
  "combinations-o2": {
    title: "ترکیب ها با اُ",
    items: [
      "بُ", "تُ", "ثُ", "جُ", "حُ", "خُ", "دُ", "ذُ", "رُ", "زُ", "سُ", "شُ", "صُ", "ضُ", "طُ", "ظُ", "عُ", "غُ", "فُ", "قُ", "لُ", "مُ", "نُ", "هُ", "وُ", "پُ", "چُ", "ژُ", "کُ", "گُ", "یُ"
    ]
  },
  "combinations-ae": {
    title: "ترکیب ها با اَ",
    items: [
      "بَ", "تَ", "ثَ", "جَ", "حَ", "خَ", "دَ", "ذَ", "رَ", "زَ", "سَ", "شَ", "صَ", "ضَ", "طَ", "ظَ", "عَ", "غَ", "فَ", "قَ", "لَ", "مَ", "نَ", "هَ", "وَ", "پَ", "چَ", "ژَ", "کَ", "گَ", "یَ"
    ]
  },
  "combinations-iy": {
    title: "ترکیب ها با ای",
    items: [
      "بی", "تی", "ثی", "جی", "حی", "خی", "دی", "ذی", "ری", "زی", "سی", "شی", "صی", "ضی", "طی", "ظی", "عی", "غی", "فی", "قی", "لی", "می", "نی", "هی", "وی", "پی", "چی", "ژی", "کی", "گی", "یی"
    ]
  },
  "combinations-e": {
    title: "ترکیب ها با اِ",
    items: [
      "بِ", "تِ", "ثِ", "جِ", "حِ", "خِ", "دِ", "ذِ", "رِ", "زِ", "سِ", "شِ", "صِ", "ضِ", "طِ", "ظِ", "عِ", "غِ", "فِ", "قِ", "لِ", "مِ", "نِ", "هِ", "وِ", "پِ", "چِ", "ژِ", "کِ", "گِ", "یِ"
    ]
  }
};
